src/Enums/МесяцыХарптоса/МесяцыХарптоса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МесяцыХарптоса</name>
  <enumValues>
    <name>Хаммер</name>
  </enumValues>
  <enumValues>
    <name>Алтуриак</name>
  </enumValues>
  <enumValues>
    <name>Чес</name>
  </enumValues>
  <enumValues>
    <name>Тарсах</name>
  </enumValues>
  <enumValues>
    <name>Миртул</name>
  </enumValues>
  <enumValues>
    <name>Киторн</name>
  </enumValues>
  <enumValues>
    <name>Флеймрул</name>
  </enumValues>
  <enumValues>
    <name>Элеасис</name>
  </enumValues>
  <enumValues>
    <name>Элейнт</name>
  </enumValues>
  <enumValues>
    <name>Марпенот</name>
  </enumValues>
  <enumValues>
    <name>Уктар</name>
  </enumValues>
  <enumValues>
    <name>Найтол</name>
  </enumValues>
</mdclass:Enum>

src/Enums/МеждудневьяХарптоса/МеждудневьяХарптоса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МеждудневьяХарптоса</name>
  <enumValues>
    <name>СерединаЗимы</name>
  </enumValues>
  <enumValues>
    <name>Зеленотравье</name>
  </enumValues>
  <enumValues>
    <name>Солнцеворот</name>
  </enumValues>
  <enumValues>
    <name>ВстречаЩитов</name>
  </enumValues>
  <enumValues>
    <name>ПраздникУрожая</name>
  </enumValues>
  <enumValues>
    <name>ПраздникЛуны</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ИгровойКалендарь/Module.bsl
// Детерминированная календарная арифметика Харптоса.
// Чистые функции: не обращаются к базе данных, регистрам или параметрам сеанса.
// Представление времени - целочисленные игровые минуты от 1 Хаммера 1 ЛД, 00:00.
//
// Структура календаря:
//   12 месяцев по 30 дней, 5 фиксированных междудневий (после Хаммера, Тарсаха,
//   Флеймрула, Элейнта, Уктара), в високосный год после Солнцеворота добавляется
//   Встреча Щитов (Shieldmeet). Високосным считается каждый год, кратный 4.
//
// Наружный интерфейс работает с предметными перечислениями МесяцыХарптоса
// и МеждудневьяХарптоса. Календарная арифметика внутри модуля выполняется через
// явное отображение значение перечисления <-> порядковый номер, без зависимости
// от внутреннего порядка значений перечисления.
//
// В общем модуле 1С не допускается объявление переменных уровня модуля, поэтому
// все числовые константы, массивы и соответствия оформлены как функции.

#Область ПрограммныйИнтерфейс

// Преобразует абсолютную игровую минуту в дату календаря Харптоса.
//
// Параметры:
//  ИгроваяМинута - Число - игровое время в минутах, целое неотрицательное.
//
// Возвращаемое значение:
//  Структура - описание даты Харптоса с полями:
//    * Год         - Число - год ЛД.
//    * Месяц       - ПеречислениеСсылка.МесяцыХарптоса - месяц, либо пустая ссылка для междудневья.
//    * День        - Число - день месяца (1..30), для междудневья 0.
//    * Час         - Число - час (0..23).
//    * Минута      - Число - минута (0..59).
//    * Междуденье  - ПеречислениеСсылка.МеждудневьяХарптоса - междуденье, либо пустая ссылка для обычного дня.
//    * НадписьДня  - Строка - представление периода без времени.
//
Функция ПолучитьДату(ИгроваяМинута) Экспорт

	ПроверитьИгровуюМинуту(ИгроваяМинута);

	Параметры = ПараметрыКалендаря();

	Год = ГодПоИгровойМинуте(ИгроваяМинута);
	Високосный = ЭтоВисокосныйГод(Год);
	ВнутриГода = ИгроваяМинута - МинутДоНачалаГода(Год);
	ДеньГода = Цел(ВнутриГода / Параметры.ЧислоМинутВДне);
	МинДня = ВнутриГода - ДеньГода * Параметры.ЧислоМинутВДне;
	Час = Цел(МинДня / Параметры.ЧислоМинутВЧасе);
	Минута = МинДня - Час * Параметры.ЧислоМинутВЧасе;

	Период = ОписатьПериодДняГода(ДеньГода, Високосный);
	ГодСтрокой = Формат(Год, "ЧГ=0");
	Если Период.Междуденье.Пустая() Тогда
		ЗначениеНадпись = Формат(Период.День, "ЧГ=0") + " " + НаименованиеМесяца(Период.Месяц) + " " + ГодСтрокой + " " + Параметры.СуффиксГодаЛД;
	Иначе
		ЗначениеНадпись = НаименованиеМеждуденья(Период.Междуденье) + " " + ГодСтрокой + " " + Параметры.СуффиксГодаЛД;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Год", Год);
	Результат.Вставить("Месяц", Период.Месяц);
	Результат.Вставить("День", Период.День);
	Результат.Вставить("Час", Час);
	Результат.Вставить("Минута", Минута);
	Результат.Вставить("Междуденье", Период.Междуденье);
	Результат.Вставить("НадписьДня", Строка(ЗначениеНадпись));

	Возврат Результат;

КонецФункции

// Преобразует обычную дату Харптоса в абсолютную игровую минуту.
//
// Параметры:
//  Год    - Число - год ЛД (>= 1).
//  Месяц  - ПеречислениеСсылка.МесяцыХарптоса - значение месяца.
//  День   - Число - день месяца (1..30).
//  Час    - Число - час (0..23), значение по умолчанию 0.
//  Минута - Число - минута (0..59), значение по умолчанию 0.
//
// Возвращаемое значение:
//  Число - абсолютное игровое время в минутах.
//
Функция ПолучитьИгровуюМинуту(Год, Месяц, День, Час = 0, Минута = 0) Экспорт

	ПроверитьГодМесяцДеньЧасМинуту(Год, Месяц, День, Час, Минута);

	Параметры = ПараметрыКалендаря();
	Смещение = СмещениеНачалаМесяца(НомерМесяца(Месяц), ЭтоВисокосныйГод(Год));

	Возврат МинутДоНачалаГода(Год) + (Смещение + День - 1) * Параметры.ЧислоМинутВДне + Час * Параметры.ЧислоМинутВЧасе + Минута;

КонецФункции

// Преобразует междуденье Харптоса в абсолютную игровую минуту.
//
// Параметры:
//  Год         - Число - год ЛД (>= 1).
//  Междуденье  - ПеречислениеСсылка.МеждудневьяХарптоса - значение междудневья.
//  Час         - Число - час (0..23), значение по умолчанию 0.
//  Минута      - Число - минута (0..59), значение по умолчанию 0.
//
// Возвращаемое значение:
//  Число - абсолютное игровое время в минутах.
//
Функция ПолучитьИгровуюМинутуМеждуденья(Год, Междуденье, Час = 0, Минута = 0) Экспорт

	ПроверитьГод(Год);
	ПроверитьЧасМинуту(Час, Минута);
	ПроверитьМеждуденье(Междуденье, Год);

	Параметры = ПараметрыКалендаря();
	ДеньГода = ДеньГодаМеждуденья(КодМеждуденья(Междуденье), ЭтоВисокосныйГод(Год));

	Возврат МинутДоНачалаГода(Год) + ДеньГода * Параметры.ЧислоМинутВДне + Час * Параметры.ЧислоМинутВЧасе + Минута;

КонецФункции

// Возвращает строковое представление даты Харптоса по абсолютной игровой минуте.
//
// Параметры:
//  ИгроваяМинута - Число - игровое время в минутах.
//
// Возвращаемое значение:
//  Строка - представление вида "5 Миртула 1492 ЛД, 14:30" или
//           "Зеленотравье 1492 ЛД, 09:00".
//
Функция ПредставлениеДаты(ИгроваяМинута) Экспорт

	ДатаХарптоса = ПолучитьДату(ИгроваяМинута);

	Возврат ДатаХарптоса.НадписьДня
		+ ", "
		+ Формат(ДатаХарптоса.Час, "ЧЦ=2; ЧВН=")
		+ ":"
		+ Формат(ДатаХарптоса.Минута, "ЧЦ=2; ЧВН=");

КонецФункции

// Определяет, является ли год високосным по правилам календаря Харптоса.
// Високосным считается каждый год, кратный 4.
//
// Параметры:
//  Год - Число - год ЛД.
//
// Возвращаемое значение:
//  Булево - Истина, если год кратен 4.
//
Функция ЭтоВисокосныйГод(Год) Экспорт

	Возврат (Год % ПараметрыКалендаря().ДелительВисокосногоГода) = 0;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает соответствие ПеречислениеСсылка.МесяцыХарптоса -> порядковый номер (1..12).
// Явное отображение используется потому, что внутренний порядок значений перечисления
// в платформе 1С не гарантируется.
//
Функция СоответствиеМесяцев()

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Хаммер,    1);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Алтуриак,  2);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Чес,       3);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Тарсах,    4);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Миртул,    5);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Киторн,    6);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Флеймрул,  7);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Элеасис,   8);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Элейнт,    9);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Марпенот, 10);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Уктар,    11);
	Соответствие.Вставить(Перечисления.МесяцыХарптоса.Найтол,   12);

	Возврат Соответствие;

КонецФункции

// Возвращает массив значений перечисления МесяцыХарптоса по порядковому номеру (индекс 1..12).
//
Функция МассивМесяцев()

	Массив = Новый Массив;
	Массив.Добавить(Перечисления.МесяцыХарптоса.ПустаяСсылка());
	Массив.Добавить(Перечисления.МесяцыХарптоса.Хаммер);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Алтуриак);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Чес);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Тарсах);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Миртул);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Киторн);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Флеймрул);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Элеасис);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Элейнт);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Марпенот);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Уктар);
	Массив.Добавить(Перечисления.МесяцыХарптоса.Найтол);

	Возврат Массив;

КонецФункции

// Возвращает порядковый номер месяца (1..12) по значению перечисления МесяцыХарптоса.
//
Функция НомерМесяца(Месяц)

	Если Месяц = Перечисления.МесяцыХарптоса.ПустаяСсылка() Тогда
		ВызватьИсключение НСтр("ru = 'Месяц не указан.'");
	КонецЕсли;

	Результат = СоответствиеМесяцев().Получить(Месяц);
	Если Результат = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Неизвестное значение месяца.'");
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает значение перечисления МесяцыХарптоса по порядковому номеру (1..12).
// Для невалидного номера возвращает пустую ссылку.
//
Функция МесяцПоНомеру(НомерМесяца)

	Массив = МассивМесяцев();
	Если НомерМесяца < 1 ИЛИ НомерМесяца > Массив.ВГраница() Тогда
		Возврат Перечисления.МесяцыХарптоса.ПустаяСсылка();
	КонецЕсли;

	Возврат Массив[НомерМесяца];

КонецФункции

// Возвращает соответствие ПеречислениеСсылка.МеждудневьяХарптоса -> код (1..6).
// Код 6 зарезервирован за Встречей Щитов (Shieldmeet), которая существует только
// в високосные годы. Порядок кодов фиксирован и опирается на положение
// междудневья в году, а не на внутренний порядок значений перечисления.
//
Функция СоответствиеМеждудневий()

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.МеждудневьяХарптоса.СерединаЗимы,  1);
	Соответствие.Вставить(Перечисления.МеждудневьяХарптоса.Зеленотравье,   2);
	Соответствие.Вставить(Перечисления.МеждудневьяХарптоса.Солнцеворот,    3);
	Соответствие.Вставить(Перечисления.МеждудневьяХарптоса.ПраздникУрожая, 4);
	Соответствие.Вставить(Перечисления.МеждудневьяХарптоса.ПраздникЛуны,   5);
	Соответствие.Вставить(Перечисления.МеждудневьяХарптоса.ВстречаЩитов,   6);

	Возврат Соответствие;

КонецФункции

// Возвращает массив значений перечисления МеждудневьяХарптоса по коду (индекс 1..6).
//
Функция МассивМеждудневий()

	Массив = Новый Массив;
	Массив.Добавить(Перечисления.МеждудневьяХарптоса.ПустаяСсылка());
	Массив.Добавить(Перечисления.МеждудневьяХарптоса.СерединаЗимы);
	Массив.Добавить(Перечисления.МеждудневьяХарптоса.Зеленотравье);
	Массив.Добавить(Перечисления.МеждудневьяХарптоса.Солнцеворот);
	Массив.Добавить(Перечисления.МеждудневьяХарптоса.ПраздникУрожая);
	Массив.Добавить(Перечисления.МеждудневьяХарптоса.ПраздникЛуны);
	Массив.Добавить(Перечисления.МеждудневьяХарптоса.ВстречаЩитов);

	Возврат Массив;

КонецФункции

// Возвращает код междудневья (1..6) по значению перечисления МеждудневьяХарптоса.
//
Функция КодМеждуденья(Междуденье)

	Если Междуденье = Перечисления.МеждудневьяХарптоса.ПустаяСсылка() Тогда
		ВызватьИсключение НСтр("ru = 'Междуденье не указано.'");
	КонецЕсли;

	Результат = СоответствиеМеждудневий().Получить(Междуденье);
	Если Результат = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Неизвестное значение междудневья.'");
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает значение перечисления МеждудневьяХарптоса по коду (1..6).
// Для невалидного кода возвращает пустую ссылку.
//
Функция МеждуденьеПоКоду(Код)

	Массив = МассивМеждудневий();
	Если Код < 1 ИЛИ Код > Массив.ВГраница() Тогда
		Возврат Перечисления.МеждудневьяХарптоса.ПустаяСсылка();
	КонецЕсли;

	Возврат Массив[Код];

КонецФункции

Функция ГодПоИгровойМинуте(ИгроваяМинута)

	Параметры = ПараметрыКалендаря();

	МинутВЦикле = Параметры.ДлинаЦиклаЛет * Параметры.МинутВОбычномГоде + Параметры.ЧислоМинутВДне;
	Циклов = Цел(ИгроваяМинута / МинутВЦикле);
	Остаток = ИгроваяМинута - Циклов * МинутВЦикле;
	БазовыйГод = Циклов * Параметры.ДлинаЦиклаЛет;

	Если Остаток < Параметры.МинутВОбычномГоде Тогда
		Возврат БазовыйГод + 1;
	ИначеЕсли Остаток < 2 * Параметры.МинутВОбычномГоде Тогда
		Возврат БазовыйГод + 2;
	ИначеЕсли Остаток < 3 * Параметры.МинутВОбычномГоде Тогда
		Возврат БазовыйГод + 3;
	Иначе
		Возврат БазовыйГод + Параметры.ДлинаЦиклаЛет;
	КонецЕсли;

КонецФункции

Функция МинутДоНачалаГода(Год)

	Параметры = ПараметрыКалендаря();

	Возврат (Год - 1) * Параметры.МинутВОбычномГоде + Цел((Год - 1) / Параметры.ДлинаЦиклаЛет) * Параметры.ЧислоМинутВДне;

КонецФункции

// Возвращает смещение (в днях) начала месяца от начала года.
// Shieldmeet добавляет один день, начиная с Элеасиса (месяц 8) в високосном году.
//
// Параметры:
//  НомерМесяца - Число - 1..12.
//  Високосный  - Булево.
//
// Возвращаемое значение:
//  Число - день года, в который начинается месяц.
//
Функция СмещениеНачалаМесяца(НомерМесяца, Високосный)

	Параметры = ПараметрыКалендаря();

	Возврат (НомерМесяца - 1) * Параметры.ДнейВМесяце
		+ КоличествоМеждудневийДоНачалаМесяца(НомерМесяца)
		+ ?(Високосный И НомерМесяца > Параметры.НомерМесяцаЭлеасис, 1, 0);

КонецФункции

// Возвращает количество фиксированных междудневий, расположенных ДО начала указанного месяца
// (без учета Shieldmeet, который зависит от високосности).
//
// Параметры:
//  НомерМесяца - Число - 1..12.
//
// Возвращаемое значение:
//  Число - 0..5.
//
Функция КоличествоМеждудневийДоНачалаМесяца(НомерМесяца)

	Параметры = ПараметрыКалендаря();

	// Середина Зимы после Хаммера (1), Зеленотравье после Тарсаха (4),
	// Солнцеворот после Флеймрула (7), Праздник Урожая после Элейнта (9),
	// Праздник Луны после Уктара (11).
	Если НомерМесяца <= Параметры.НомерМесяцаХаммер Тогда
		Возврат 0;
	ИначеЕсли НомерМесяца <= Параметры.НомерМесяцаТарсах Тогда
		Возврат 1;
	ИначеЕсли НомерМесяца <= Параметры.НомерМесяцаФлеймрул Тогда
		Возврат 2;
	ИначеЕсли НомерМесяца <= Параметры.НомерМесяцаЭлейнт Тогда
		Возврат 3;
	ИначеЕсли НомерМесяца <= Параметры.НомерМесяцаУктар Тогда
		Возврат 4;
	Иначе
		Возврат 5;
	КонецЕсли;

КонецФункции

// Описывает период дня года (месяц/день или междуденье) по номеру дня.
// Shieldmeet сдвигает Праздник Урожая и Праздник Луны на 1 день вперёд,
// так как вставляется между Солнцеворотом и Элеасисом.
//
// Параметры:
//  ДеньГода   - Число - номер дня года (0-индексированный).
//  Високосный - Булево - признак високосного года.
//
// Возвращаемое значение:
//  Структура - с полями:
//    * Месяц       - ПеречислениеСсылка.МесяцыХарптоса - месяц, либо пустая ссылка для междудневья.
//    * День        - Число - день месяца (1..30), для междудневья 0.
//    * Междуденье  - ПеречислениеСсылка.МеждудневьяХарптоса - междуденье, либо пустая ссылка для обычного дня.
//
Функция ОписатьПериодДняГода(ДеньГода, Високосный)

	Параметры = ПараметрыКалендаря();

	Результат = Новый Структура;
	Результат.Вставить("Месяц", Перечисления.МесяцыХарптоса.ПустаяСсылка());
	Результат.Вставить("День", 0);
	Результат.Вставить("Междуденье", Перечисления.МеждудневьяХарптоса.ПустаяСсылка());

	КодМеждуденьяЧислом = КодМеждуденьяПоДнюГода(ДеньГода, Високосный);
	Если КодМеждуденьяЧислом <> 0 Тогда
		Результат.Междуденье = МеждуденьеПоКоду(КодМеждуденьяЧислом);
		Возврат Результат;
	КонецЕсли;

	НомерМесяцаЧислом = 0;
	Для Сч = 1 По Параметры.МесяцевВГоду Цикл
		Если ДеньГода >= СмещениеНачалаМесяца(Сч, Високосный) Тогда
			НомерМесяцаЧислом = Сч;
		КонецЕсли;
	КонецЦикла;

	Результат.Месяц = МесяцПоНомеру(НомерМесяцаЧислом);
	Результат.День = ДеньГода - СмещениеНачалаМесяца(НомерМесяцаЧислом, Високосный) + 1;

	Возврат Результат;

КонецФункции

// Возвращает код междудневья для указанного дня года (0 если день обычный).
//
// Параметры:
//  ДеньГода   - Число - 0-индексированный день года.
//  Високосный - Булево.
//
// Возвращаемое значение:
//  Число - 0, либо 1..6.
//
Функция КодМеждуденьяПоДнюГода(ДеньГода, Високосный)

	Параметры = ПараметрыКалендаря();

	Если ДеньГода = Параметры.ДеньГодаСерединаЗимы Тогда
		Возврат Параметры.КодСерединаЗимы;
	ИначеЕсли ДеньГода = Параметры.ДеньГодаЗеленотравья Тогда
		Возврат Параметры.КодЗеленотравье;
	ИначеЕсли ДеньГода = Параметры.ДеньГодаСолнцеворота Тогда
		Возврат Параметры.КодСолнцеворот;
	ИначеЕсли Високосный И ДеньГода = Параметры.ДеньГодаShieldmeet Тогда
		Возврат Параметры.КодShieldmeet;
	ИначеЕсли ДеньГода = ДеньГодаПраздникаУрожая(Високосный) Тогда
		Возврат Параметры.КодПраздникУрожая;
	ИначеЕсли ДеньГода = ДеньГодаПраздникаЛуны(Високосный) Тогда
		Возврат Параметры.КодПраздникЛуны;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

// Возвращает наименование месяца в родительном падеже по значению перечисления.
//
// Параметры:
//  Месяц - ПеречислениеСсылка.МесяцыХарптоса.
//
// Возвращаемое значение:
//  Строка - наименование месяца в родительном падеже, либо пустая строка.
//
Функция НаименованиеМесяца(Месяц)

	Если Месяц = Перечисления.МесяцыХарптоса.ПустаяСсылка() Тогда
		Возврат "";
	КонецЕсли;

	Возврат НаименованияМесяцев()[НомерМесяца(Месяц)];

КонецФункции

// Возвращает наименование междудневья по значению перечисления.
//
// Параметры:
//  Междуденье - ПеречислениеСсылка.МеждудневьяХарптоса.
//
// Возвращаемое значение:
//  Строка - наименование междудневья, либо пустая строка.
//
Функция НаименованиеМеждуденья(Междуденье)

	Если Междуденье = Перечисления.МеждудневьяХарптоса.ПустаяСсылка() Тогда
		Возврат "";
	КонецЕсли;

	Возврат НаименованияМеждудневий()[КодМеждуденья(Междуденье)];

КонецФункции

// Возвращает день года (0-индексированный) для указанного кода междудневья.
// Праздник Урожая и Праздник Луны сдвинуты на 1 день вперёд в високосный год,
// так как Shieldmeet добавляется между Солнцеворотом и Элеасисом.
//
// Параметры:
//  Код        - Число - код междудневья (1..6).
//  Високосный - Булево - признак високосного года.
//
// Возвращаемое значение:
//  Число - день года, в который наступает соответствующее междуденье.
//
Функция ДеньГодаМеждуденья(Код, Високосный)

	Параметры = ПараметрыКалендаря();

	Если Код = Параметры.КодСерединаЗимы Тогда
		Возврат Параметры.ДеньГодаСерединаЗимы;
	ИначеЕсли Код = Параметры.КодЗеленотравье Тогда
		Возврат Параметры.ДеньГодаЗеленотравья;
	ИначеЕсли Код = Параметры.КодСолнцеворот Тогда
		Возврат Параметры.ДеньГодаСолнцеворота;
	ИначеЕсли Код = Параметры.КодПраздникУрожая Тогда
		Возврат ДеньГодаПраздникаУрожая(Високосный);
	ИначеЕсли Код = Параметры.КодПраздникЛуны Тогда
		Возврат ДеньГодаПраздникаЛуны(Високосный);
	ИначеЕсли Код = Параметры.КодShieldmeet Тогда
		Возврат Параметры.ДеньГодаShieldmeet;
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный код междудневья.'");
	КонецЕсли;

КонецФункции

Функция ДеньГодаПраздникаУрожая(Високосный)

	Параметры = ПараметрыКалендаря();

	Возврат СмещениеНачалаМесяца(Параметры.НомерМесяцаЭлейнт, Високосный) + Параметры.ДнейВМесяце;

КонецФункции

Функция ДеньГодаПраздникаЛуны(Високосный)

	Параметры = ПараметрыКалендаря();

	Возврат СмещениеНачалаМесяца(Параметры.НомерМесяцаУктар, Високосный) + Параметры.ДнейВМесяце;

КонецФункции

Процедура ПроверитьИгровуюМинуту(ИгроваяМинута)

	Если ТипЗнч(ИгроваяМинута) <> Тип("Число") Тогда
		ВызватьИсключение НСтр("ru = 'Игровая минута должна быть числом.'");
	КонецЕсли;

	Если ИгроваяМинута < 0 Тогда
		ВызватьИсключение НСтр("ru = 'Игровая минута не может быть отрицательной.'");
	КонецЕсли;

	Если Цел(ИгроваяМинута) <> ИгроваяМинута Тогда
		ВызватьИсключение НСтр("ru = 'Игровая минута должна быть целым числом.'");
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьГодМесяцДеньЧасМинуту(Год, Месяц, День, Час, Минута)

	ПроверитьГод(Год);
	ПроверитьМесяц(Месяц);
	ПроверитьДень(День);
	ПроверитьЧасМинуту(Час, Минута);

КонецПроцедуры

Процедура ПроверитьГод(Год)

	Если ТипЗнч(Год) <> Тип("Число") Тогда
		ВызватьИсключение НСтр("ru = 'Год должен быть числом.'");
	КонецЕсли;

	Если Цел(Год) <> Год Тогда
		ВызватьИсключение НСтр("ru = 'Год должен быть целым числом.'");
	КонецЕсли;

	Если Год < ПараметрыКалендаря().МинимальныйГод Тогда
		ВызватьИсключение НСтр("ru = 'Год должен быть не меньше 1.'");
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьМесяц(Месяц)

	Если ТипЗнч(Месяц) <> Тип("ПеречислениеСсылка.МесяцыХарптоса") Тогда
		ВызватьИсключение НСтр("ru = 'Месяц должен быть значением перечисления МесяцыХарптоса.'");
	КонецЕсли;

	Если Месяц = Перечисления.МесяцыХарптоса.ПустаяСсылка() Тогда
		ВызватьИсключение НСтр("ru = 'Месяц должен быть указан.'");
	КонецЕсли;

	НомерМесяца(Месяц);

КонецПроцедуры

Процедура ПроверитьДень(День)

	Параметры = ПараметрыКалендаря();

	Если ТипЗнч(День) <> Тип("Число") Тогда
		ВызватьИсключение НСтр("ru = 'День должен быть числом.'");
	КонецЕсли;

	Если Цел(День) <> День Тогда
		ВызватьИсключение НСтр("ru = 'День должен быть целым числом.'");
	КонецЕсли;

	Если День < 1 ИЛИ День > Параметры.ДнейВМесяце Тогда
		ВызватьИсключение НСтр("ru = 'День должен быть в диапазоне 1..30.'");
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЧасМинуту(Час, Минута)

	Параметры = ПараметрыКалендаря();

	Если ТипЗнч(Час) <> Тип("Число") Тогда
		ВызватьИсключение НСтр("ru = 'Час должен быть числом.'");
	КонецЕсли;

	Если Цел(Час) <> Час Тогда
		ВызватьИсключение НСтр("ru = 'Час должен быть целым числом.'");
	КонецЕсли;

	Если Час < 0 ИЛИ Час > Параметры.МаксимальныйЧас Тогда
		ВызватьИсключение НСтр("ru = 'Час должен быть в диапазоне 0..23.'");
	КонецЕсли;

	Если ТипЗнч(Минута) <> Тип("Число") Тогда
		ВызватьИсключение НСтр("ru = 'Минута должна быть числом.'");
	КонецЕсли;

	Если Цел(Минута) <> Минута Тогда
		ВызватьИсключение НСтр("ru = 'Минута должна быть целым числом.'");
	КонецЕсли;

	Если Минута < 0 ИЛИ Минута > Параметры.МаксимальнаяМинута Тогда
		ВызватьИсключение НСтр("ru = 'Минута должна быть в диапазоне 0..59.'");
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьМеждуденье(Междуденье, Год)

	Параметры = ПараметрыКалендаря();

	Если ТипЗнч(Междуденье) <> Тип("ПеречислениеСсылка.МеждудневьяХарптоса") Тогда
		ВызватьИсключение НСтр("ru = 'Междуденье должно быть значением перечисления МеждудневьяХарптоса.'");
	КонецЕсли;

	Если Междуденье = Перечисления.МеждудневьяХарптоса.ПустаяСсылка() Тогда
		ВызватьИсключение НСтр("ru = 'Междуденье должно быть указано.'");
	КонецЕсли;

	Код = КодМеждуденья(Междуденье);

	Если Код = Параметры.КодShieldmeet И НЕ ЭтоВисокосныйГод(Год) Тогда
		ВызватьИсключение НСтр("ru = 'Shieldmeet существует только в високосный год.'");
	КонецЕсли;

КонецПроцедуры

// Возвращает структуру со всеми числовыми параметрами календаря.
// Используется как единая точка доступа к константам из служебных функций модуля.
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыКалендаря()

	ЧислоМинутВЧасе = 60;
	ЧасовВДне = 24;
	ЧислоМинутВДне = ЧасовВДне * ЧислоМинутВЧасе;
	ДнейВМесяце = 30;
	МесяцевВГоду = 12;
	МинимальныйГод = 1;
	МаксимальнаяМинута = ЧислоМинутВЧасе - 1;
	МаксимальныйЧас = ЧасовВДне - 1;
	ДелительВисокосногоГода = 4;
	ДлинаЦиклаЛет = 4;
	СуффиксГодаЛД = "ЛД";

	НомерМесяцаХаммер = 1;
	НомерМесяцаТарсах = 4;
	НомерМесяцаФлеймрул = 7;
	НомерМесяцаЭлеасис = 8;
	НомерМесяцаЭлейнт = 9;
	НомерМесяцаУктар = 11;

	КодСерединаЗимы = 1;
	КодЗеленотравье = 2;
	КодСолнцеворот = 3;
	КодПраздникУрожая = 4;
	КодПраздникЛуны = 5;
	КодShieldmeet = 6;

	МинутВОбычномГоде = (МесяцевВГоду * ДнейВМесяце + КодПраздникЛуны) * ЧислоМинутВДне;

	// Дни года для фиксированных междудневий (0-индексированные).
	// НомерМесяца * ДнейВМесяце + КодМеждуденья - 1:
	//   - день после N месяцев = N * ДнейВМесяце (начало (N+1)-го месяца),
	//   - минус 1 из-за 0-индексации.
	ДеньГодаСерединаЗимы = НомерМесяцаХаммер * ДнейВМесяце + КодСерединаЗимы - 1;
	ДеньГодаЗеленотравья = НомерМесяцаТарсах * ДнейВМесяце + КодЗеленотравье - 1;
	ДеньГодаСолнцеворота = НомерМесяцаФлеймрул * ДнейВМесяце + КодСолнцеворот - 1;
	ДеньГодаShieldmeet = ДеньГодаСолнцеворота + 1;

	Результат = Новый Структура;
	Результат.Вставить("ЧислоМинутВЧасе", ЧислоМинутВЧасе);
	Результат.Вставить("ЧислоМинутВДне", ЧислоМинутВДне);
	Результат.Вставить("ДнейВМесяце", ДнейВМесяце);
	Результат.Вставить("МесяцевВГоду", МесяцевВГоду);
	Результат.Вставить("МинимальныйГод", МинимальныйГод);
	Результат.Вставить("МаксимальныйЧас", МаксимальныйЧас);
	Результат.Вставить("МаксимальнаяМинута", МаксимальнаяМинута);
	Результат.Вставить("ДелительВисокосногоГода", ДелительВисокосногоГода);
	Результат.Вставить("ДлинаЦиклаЛет", ДлинаЦиклаЛет);
	Результат.Вставить("МинутВОбычномГоде", МинутВОбычномГоде);
	Результат.Вставить("СуффиксГодаЛД", СуффиксГодаЛД);
	Результат.Вставить("НомерМесяцаХаммер", НомерМесяцаХаммер);
	Результат.Вставить("НомерМесяцаТарсах", НомерМесяцаТарсах);
	Результат.Вставить("НомерМесяцаФлеймрул", НомерМесяцаФлеймрул);
	Результат.Вставить("НомерМесяцаЭлеасис", НомерМесяцаЭлеасис);
	Результат.Вставить("НомерМесяцаЭлейнт", НомерМесяцаЭлейнт);
	Результат.Вставить("НомерМесяцаУктар", НомерМесяцаУктар);
	Результат.Вставить("КодСерединаЗимы", КодСерединаЗимы);
	Результат.Вставить("КодЗеленотравье", КодЗеленотравье);
	Результат.Вставить("КодСолнцеворот", КодСолнцеворот);
	Результат.Вставить("КодПраздникУрожая", КодПраздникУрожая);
	Результат.Вставить("КодПраздникЛуны", КодПраздникЛуны);
	Результат.Вставить("КодShieldmeet", КодShieldmeet);
	Результат.Вставить("ДеньГодаСерединаЗимы", ДеньГодаСерединаЗимы);
	Результат.Вставить("ДеньГодаЗеленотравья", ДеньГодаЗеленотравья);
	Результат.Вставить("ДеньГодаСолнцеворота", ДеньГодаСолнцеворота);
	Результат.Вставить("ДеньГодаShieldmeet", ДеньГодаShieldmeet);

	Возврат Результат;

КонецФункции

// Возвращает массив наименований месяцев в родительном падеже (индекс 1..12).
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция НаименованияМесяцев()

	Наименования = Новый Массив;
	Наименования.Добавить("");
	Наименования.Добавить("Хаммера");
	Наименования.Добавить("Алтуриака");
	Наименования.Добавить("Чеса");
	Наименования.Добавить("Тарсаха");
	Наименования.Добавить("Миртула");
	Наименования.Добавить("Киторна");
	Наименования.Добавить("Флеймрула");
	Наименования.Добавить("Элеасиса");
	Наименования.Добавить("Элейнта");
	Наименования.Добавить("Марпенота");
	Наименования.Добавить("Уктара");
	Наименования.Добавить("Найтола");

	Возврат Наименования;

КонецФункции

// Возвращает массив наименований междудневий (индекс 1..6).
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция НаименованияМеждудневий()

	Наименования = Новый Массив;
	Наименования.Добавить("");
	Наименования.Добавить("Середина Зимы");
	Наименования.Добавить("Зеленотравье");
	Наименования.Добавить("Солнцеворот");
	Наименования.Добавить("Праздник Урожая");
	Наименования.Добавить("Праздник Луны");
	Наименования.Добавить("Встреча Щитов");

	Возврат Наименования;

КонецФункции

#КонецОбласти
